[
    {
        "title": "Moving Places",
        "description": "A React application that allows you to compare the cost of living of two cities. I started this taking some inspiration of another similar application, I wanted to create this application as an excuse to learn some React Hooks as it was a while since I worked with React. Hopefully if I can gather some feedback on the website I will continue to do some updates on it as it can be a useful tool for those thinking of moving cities.",
        "image": {
            "source": "./images/movingplaces.jpg",
            "alt": "Moving Places"
        },
        "tags": [
            {
                "text": "JavaScript"
            },
            {
                "text": "React"
            },
            {
                "text": "HTML"
            },
            {
                "text": "CSS"
            }
        ],
        "buttons": [
            {
                "text": "View Source",
                "link": "https://github.com/ivanseed/cost-of-living"
            },
            {
                "text": "View Site",
                "link": "https://movingplaces.io/"
            }
        ]
    },
    {
        "title": "Sky Sport Germany",
        "description": "Built from the ground up, Sky Sport Germany has been the biggest and most rewarding project I have worked on. I was given a fantastic opportunity to work with a highly experienced team to deliver a brand new Sports portal for Sky Deutschland. I got hands on experience working in an agile environment, learning and collaborating with others which greatly improved my coding skills and also my software engineering practices.",
        "image": {
            "source": "./images/skysport.jpg",
            "alt": "Sky Sport Germany"
        },
        "tags": [
            {
                "text": "PHP"
            },
            {
                "text": "Symfony"
            },
            {
                "text": "NodeJS"
            },
            {
                "text": "Docker"
            },
            {
                "text": "HTML"
            },
            {
                "text": "SASS"
            }
        ],
        "buttons": [
            {
                "text": "View Site",
                "link": "https://sport.sky.de/"
            }
        ]
    },
    {
        "title": "GitStats",
        "description": "A small app that uses the GitHub API to filter the most stars and forked repositories with the option to filter by language. The main purpose of this project for me personally was to get an idea of the benefits of using PreactJS over React so I could then apply it at Sky. It was a good learning process in which I had to do a lot more reading into the framework that I normally would do to learn how PreactJS can offer the same functionality as React but at a smaller bundle size. I also opened this project to Hacktoberfest which gave me experience opening up a project to become more open sourced.",
        "image": {
            "source": "./images/gitstats.jpg",
            "alt": "GitStats"
        },
        "tags": [
            {
                "text": "JavaScript"
            },
            {
                "text": "PreactJS"
            },
            {
                "text": "HTML"
            },
            {
                "text": "CSS"
            }
        ],
        "buttons": [
            {
                "text": "View Source",
                "link": "https://github.com/ivanseed/gitstats"
            },
            {
                "text": "View Site",
                "link": "https://ivanseed.github.io/gitstats"
            }
        ]
    },
    {
        "title": "Portfolio",
        "description": "Got to fill up this project list somehow, am I right? My portfolio has gone through many different designs, however after being inspired by a post online of a data driven portfolio I created this. Sections powered by JSON files so I need only update them. the entire project is on GitHub if you want to see how it works it was also was a great excuse to practice some ReactJS.",
        "image": {
            "source": "./images/portfolio.jpg",
            "alt": "Portfolio"
        },
        "tags": [
            {
                "text": "JavaScript"
            },
            {
                "text": "ReactJS"
            },
            {
                "text": "HTML"
            },
            {
                "text": "SCSS"
            }
        ],
        "buttons": [
            {
                "text": "View Source",
                "link": "https://github.com/ivanseed/ivanseed.github.io"
            }
        ]
    }
]
